import { PremiumServerDuration } from "./CommandSettings";

export const WarnReasonsChoices = [
    ["Оскорбления"],
    ["Распространение личной информации без согласия её владельца."],
    ["Флуд"],
    ["Спам"],
    ["Агрессивный троллинг"],
    ["Издевательство над личностью."],
    ["Tоксичность по отношению к другим участникам сервера."],
    ["Агрессивные высказывания"],
    ["Обсуждение непристойных вещей."],
    ["Экстремизм"],
    ["Шовинизм"],
    ["Сексизм"],
    ["Национализм"],
    ["Расизм"],
    ["Провоцирование администрации"],
    ["Запрещённая Реклама"]
].map(x => [x[0], x[0]]) as any as string[][];

export const Durations = [
    ["2 минуты", "2m"],
    ["10 минут", "10m"],
    ["30 минут", "30m"],
    ["1 час", "1h"],
    ["2 часа", "2h"],
    ["3 часа", "3h"],
    ["5 часов", "5h"],
    ["8 часов", "8h"],
    ["12 часов", "12h"],
    ["1 день", "1d"],
    ["2 дня", "2d"],
    ["3 дня", "3d"],
    ["5 дней", "5d"],
    ["1 неделя", "1w"],
    ["2 недели", "2w"],
    ["1 месяц", "30d"]
] as string[][];

export const PremiumServerDurationOptions: string[][] = PremiumServerDuration.map(obj => {
    return [`${obj.visual}`, obj.duration]
})